---
kind: method
id: M:Autodesk.Revit.DB.AnnotationSymbol.addLeader
source: html/558c4f77-a51a-28a9-3c1e-41bdcede3f98.htm
---
# Autodesk.Revit.DB.AnnotationSymbol.addLeader Method

add a leader to this annotation symbol.

## Syntax (C#)
```csharp
public void addLeader()
```